---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyJoinedGeometryWarn
source: html/375a86a5-73bf-4e43-e008-cc31932a15d0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyJoinedGeometryWarn Property

Joined solid geometry cannot be copied as a whole. Instead, select the individual extrusions, etc., using Pick box or Ctrl-select and copy them.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyJoinedGeometryWarn { get; }
```